package YANDEX.MbTask;

/** Дан массив точек с целочисленными координатами (x,y).
 * Определить существует ли вертикальная прямая, делящая все точки,
 * не лежащей на ней на 2 симметричных относительно этой прямой набора точек.
 * Наборы симметричны, когда каждая точка исходного массива имеет пару из другого набор.
 * примеры:
 * 0,0 0,1 1,1 2,2 3,1 4,1 4,0  = true
 * 0,0 0,0 1,1 2,2 3,1 4,1 4,0  = true
 * 0,0 0,0 1,1 2,2 3,1 4,0 = false
 * () = true
 * 0,0 = true
 * 0,0 10,0 = true
 * 0,0 11,1 = false
 * 0,0 1,0 3,0 = false
*/
// https://www.lintcode.com/problem/908/
public class LineReflection {

}
