package YANDEX.tasks;

import java.util.ArrayList;
import java.util.List;

public class FindAllAnagramsinaString438 {
    /**
     * https://leetcode.com/problems/find-all-anagrams-in-a-string/description/
     * Учитывая две строки s и p, верните массив всех начальных индексов p's anagrams в s.
     * Вы можете вернуть ответ в любом порядке.
     *
     * s = "cbaebabacd", p = "abc".
     * Выход: [0,6]
     * Объяснение:
     * Подстрока с начальным индексом = 0 — это "cba", которая является анаграммой "abc".
     * Подстрока с начальным индексом = 6 — это "bac", которая является анаграммой "abc".
     * Пример 2:
     *
     * Входные данные: s = "abab", p = "ab"
     * Выходные данные: [0,1,2]
     * Объяснение:
     * Подстрока с начальным индексом = 0 — это "ab", которая является анаграммой "ab".
     * Подстрока с начальным индексом = 1 — это "ba", которая является анаграммой "ab".
     * Подстрока с начальным индексом = 2 — это "ab", которая является анаграммой "ab".
     *
     * Идея: Скользящее окно и подсчёт совпадений - метч.
     * Если строка s1 > s2 - всегда false, не будет перестановок.
     *
     * Выделяем два массива, которые будем использовать для проверки совпадений.
     * Так как используются a-z = 26, и такого же размера массив.
     * Т.е. в first: [a=1,b=1,c=0,d=0...z=0]
     * в second [a=0,b=0...z=0]
     * В таком случае метч = 23, так как в second нет букв a,b,c в указанном кол-ве.
     * Если окно содержит перестановку s1, то first == second.
     *
     * Заполняем оба массива первыми m буквами.
     * Вводим счётчик метчей:
     * Сравниваем оба массива first и second и считаем метчи.
     * Важно учесть, что если текущее окно уже содержит анаграму, нужно его добавить.
     *
     * Вводим два указателя:
     * l = 0, r = m;
     * В цикле, по слову s2:
     *  idx = индекс буквы на позиции r, для сравнения в обоих массивах
     *  second[idx]++ (увеличиваем кол-во этой буквы в окне)
     *  Если Кол-во требуемых буквы == кол-ву в окне: match++
     *  Если Кол-во требуемых буквы + 1 == кол-ву в окне: match-- (значит взяли лишние буквы)
     *
     *  idx = индекс буквы на позиции l, для сравнения в обоих массивах
     *  second[idx]++ (увеличиваем кол-во этой буквы в окне)
     *  Если Кол-во требуемых буквы == кол-ву в окне: match++
     *  Если Кол-во требуемых буквы - 1 == кол-ву в окне: match-- (значит удалил нужную букву)
     *  l++ (двигаем левый указ)
     *  Если метчей == 26, то нашли перестановку в текущем окне.
     *
     * Сложность:
     *  по времени: O(n)
     *  по памяти: O(26)
     *
     * @param s String
     * @param p String
     */
    public List<Integer> findAnagrams(String s, String p) {
        if (s.length() < p.length()) return List.of();
        int n = s.length();
        int m = p.length();
        int[] first = new int[26];
        int[] second = new int[26];
        for (int i = 0; i < m; i++) {
            first[p.charAt(i) - 'a']++;
            second[s.charAt(i) - 'a']++;
        }
        int match = 0;
        for (int i = 0; i < 26; i++) {
            if (first[i] == second[i]) match++;
        }
        List<Integer> res = new ArrayList<>();
        int l = 0;
        if (match == 26) res.add(l);
        for (int r = m; r < n; r++) {
            int idx = s.charAt(r) - 'a';
            second[idx]++;
            if (first[idx] == second[idx]) match++;
            else if (first[idx] + 1 == second[idx]) match--;

            idx = s.charAt(l) - 'a';
            second[idx]--;
            if (first[idx] == second[idx]) match++;
            else if (first[idx] - 1 == second[idx]) match--;
            l++;
            if (match == 26) res.add(l);
        }
        return res;
    }
}
