package YANDEX.tasks;

public class LongestStrictlyIncreasingorStrictlyDecreasingSubarray3105Index {
    /**
     * https://leetcode.com/problems/longest-strictly-increasing-or-strictly-decreasing-subarray/description/
     * В оригинале просят вывести длинну.
     *
     * В текущей реализации, вернём индексы.
     *
     * Вам дан массив целых чисел nums.
     * Верните Индексы самого длинного подмассива из nums который является строго возрастающим или строго убывающим.
     * Если таковых нет, верните [-1,-1]
     *
     * Входные данные: nums = [3,2,1]
     * Выходные данные: [0,1,2]
     * Пояснение:
     * Строго возрастающие подмассивы nums — это [3], [2], и [1].
     * Строго убывающие подмассивы nums — это [3], [2], [1], [3,2], [2,1], и [3,2,1].
     * Следовательно, мы возвращаем [0,1,2].
     *
     * Входные данные: nums = [3,3,3,3]
     * Выходные данные: [0,0]
     * Пояснение:
     * Строго возрастающие подмассивы nums — это [3], [3], [3], и [3].
     * Строго убывающие подмассивы nums — это [3], [3], [3], и [3].
     * Следовательно, мы возвращаем [0,0].
     *
     * Входные данные: nums = []
     * Выходные данные: [-1,-1]
     * Пояснение:
     * Строго возрастающие подмассивы nums — это [].
     * Строго убывающие подмассивы nums — это [].
     * Следовательно, мы возвращаем [-1,-1].
     *
     * Идея:
     * Используем два указателя и результирующие указатели.
     * upStart, downStart - указатели на начало возрастающей и убывающей последовательности
     * resStart, resEnd - указатели на начало и конец, самой длинной подпоследовательности
     *
     * В цикле от едининцы, чтобы проверять с предыдущим:
     *  Если текущий меньше предыдущего:
     *      обновляем указатель на убывающую последовательность
     *      указатель на возрастающую последовательность растёт.
     *  Если текущий больше предыдущего:
     *      Обновляем указатель на возрастающую последовательность
     *      указатель на убывающую последовательность растёт
     *  Иначе: обновляем оба указателя
     *
     *  Если Текущее окно возрастающей последовательности, больше предыдущей подпоследовательности:
     *      Обновляем результирующие индексы:
     *          Начало результирующего - начало возрастающей последовательности
     *          Конец - текущий индекс.
     *  Если Текущее окно убывающей последовательности, больше предыдущей подпоследовательности:
     *        Обновляем результирующие индексы:
     *            Начало результирующего - начало убывающей последовательности
     *            Конец - текущий индекс.
     *
     * Сложность:
     *  по времени: O(n)
     *  по памяти: O(1)
     *
     * @param nums int[]
     */
    public int[] longestMonotonicSubarray(int[] nums) {
       if (nums == null || nums.length == 0) return  new int[]{-1,-1};

       int upStart = 0, downStart = 0;
       int resStart = 0, resEnd = 0;
       for (int i = 1; i < nums.length; i++) {
           if (nums[i] < nums[i-1]) {
               downStart = i;
           } else if (nums[i] > nums[i-1]) {
               upStart = i;
           } else {
               downStart = i;
               upStart = i;
           }

           if (i - upStart > resEnd - resStart) {
               resStart = upStart;
               resEnd = i;
           }
           if (i - downStart > resEnd - resStart) {
               resStart = downStart;
               resEnd = i;
           }
       }
       return new int[] {resStart, resEnd};
    }

    // Оригинал
    public int longestMonotonicSubarrayOriginal(int[] nums) {
        if(nums.length == 0) return 0;
        int maxLen = 1;
        int up = 1;
        int down = 1;
        for (int i = 1; i < nums.length; i++) {
            if (nums[i] > nums[i-1]) {
                up++;
                down = 1;
            } else if (nums[i] < nums[i-1]) {
                down++;
                up = 1;
            } else {
                up = 1;
                down = 1;
            }
            maxLen = Math.max(maxLen, Math.max(up, down));
        }
        return maxLen;
    }
}
