package YANDEX.tasks;

public class MaxConsecutiveOnesIII1004 {
    /**
     * https://leetcode.com/problems/max-consecutive-ones-iii/
     * Дан массив из [0,1], найти самую длинную последовательность из 1 с учётом k замен 0 на 1.
     * Вывести максимальную длинну
     *
     * nums = [1,1,1,0,0,0,1,1,1,1,0], k = 2
     * Output: 6
     * Пояснение: [1,1,1,0,0,1,1,1,1,1,1]
     * Мы поменяли 0 на 1 k раз на местах (5 ,10), самая длинная последовательность 10 - 5 + 1  = 6(так как индексы)
     * Example 2:
     *
     * nums = [0,0,1,1,0,0,1,1,1,0,1,1,0,0,0,1,1,1,1], k = 3
     * Output: 10
     * Пояснение: [0,0,1,1,1,1,1,1,1,1,1,1,0,0,0,1,1,1,1]
     * Мы поменяли 0 на 1 k раз на местах (4,5,9), самая длинная последовательность 11 - 2 + 1  = 10(так как индексы)
     *
     * Идея: Два указателя и проверка на условие
     *
     * Вводим два указателя:
     * l = 0, r = 0;
     * В цикле, пока r < nums.length:
     *  Если встретили 0, уменьшаем кол-во замен
     *
     *  В цикле пока l < r && k < 0:
     *      Заходим в том случае, если кончились замены и взяли лишний ноль.
     *      Если лев указ на 0, то увеличиваем кол-во замен
     *      Двигаем левый указ
     *
     *  Если кол-во замен больше -1, то окно валидно и считаем максимум.
     *
     * Выводим максимум.
     *
     * Сложность:
     *  по времени: O(n)
     *  по памяти: O(1)
     *
     * @param nums int[]
     * @param k int
     */
    public int longestOnes(int[] nums, int k) {
        int l = 0;
        int r = 0;
        int res = 0;
        while (r < nums.length) {
            if (nums[r] == 0) k--;
            while (l < r && k < 0) {
                if (nums[l] == 0) k++;
                l++;
            }
            if (k >= 0) {
                res = Math.max(res, r - l + 1);
            }
            r++;
        }
        return res;
    }
}
